Documents/Лео_ВводФактаТоварооборотаНепрямыхКлиентов/Лео_ВводФактаТоварооборотаНепрямыхКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_ВводФактаТоварооборотаНепрямыхКлиентов</name>
  <registerRecords>AccumulationRegister.Лео_ПланФактПримииНепрямымКлиентам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Факт</name>
    <attributes>
      <name>ТорговаяТочка</name>
      <type>
        <types>CatalogRef.Лео_ТорговыеТочки</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товарооборот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксированнаяСуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/Лео_ПареметрыРасчетаПремииКлиентам/Лео_ПареметрыРасчетаПремииКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ПареметрыРасчетаПремииКлиентам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойТоварооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварооборотСУчетомНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтчета</name>
    <type>
      <types>EnumRef.Лео_ТипОтчетаНепрямыхКлиентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сеть</name>
    <type>
      <types>CatalogRef.Лео_ТорговыеТочки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_ВводФактаТоварооборотаНепрямыхКлиентов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ФактТоварооборотПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ФактПроцентПремииПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ФактФиксированнаяСуммаПремииПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
	ПересчетСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтроки(ТекСтрока)
	
	Если  ТекСтрока.Товарооборот > 0 Тогда
		Если ТекСтрока.ПроцентПремии  > 0 Тогда
			ТекСтрока.Премия =  ТекСтрока.Товарооборот / 100 *  ТекСтрока.ПроцентПремии +  ТекСтрока.ФиксированнаяСуммаПремии;
		Иначе
			ТекСтрока.Премия = ТекСтрока.ФиксированнаяСуммаПремии;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФактПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если   НоваяСтрока Тогда
		ТекСтрока = ЭтаФорма.Элементы.Факт.ТекущиеДанные;
		СтруктураПараметров =  ПолучитьПараметрыРасчета(Объект.Дата,Объект.Сеть);
		Если НЕ СтруктураПараметров = Неопределено Тогда
			ТекСтрока.ПроцентПремии = СтруктураПараметров.ПроцентПремии;
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПараметрыРасчета(ДатаСреза,Сеть)
	
	СтруктураПараметров  = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Контрагент,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Сеть,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Периодичность,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Договор,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ПроцентПремии,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ФиксированнаяСумма,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.ГодовойТоварооборот,
		|	Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних.Действует
		|ИЗ
		|	РегистрСведений.Лео_ПареметрыРасчетаПремииКлиентам.СрезПоследних(
		|			&ДатаСреза,
		|			Сеть = &Сеть
		|				И Действует = ИСТИНА) КАК Лео_ПареметрыРасчетаПремииКлиентамСрезПоследних";

	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Сеть", Сеть);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметров = Новый Структура("ПроцентПремии, ФиксированнаяСумма", ВыборкаДетальныеЗаписи.ПроцентПремии ,ВыборкаДетальныеЗаписи.ФиксированнаяСумма);

	КонецЦикла;

	Возврат СтруктураПараметров 	
КонецФункции
